note/2020/painless-transition-to-portable-dumper/index.org
#+SETUPFILE: ../../setup.org
#+TITLE: Painless Transition to Portable Dumper
#+DATE: <2020-01-17 Fri 23:34>
#+OPTIONS: toc:1
#+TAGS: Emacs

Emacs 27 is coming with many exciting new features including the portable dumper. There has been attempts to use portable dumper to speed up Emacs startup time. I know Spacemacs [[https://github.com/syl20bnr/spacemacs/blob/develop/core/core-dumper.el][does this]] from a long time ago [fn:1].  But I couldn’t find any literature on using portable dumper for one’s own init.el. Here I record my take on adopting portable dumper, including gotcha’s I found, the general design I use, and some fixes, hacks and tricks I used.

With portable dumper, my startup time reduced from 2.47s to 0.76s (3x). (Everybody measures their startup differently. As a common measure, esup gives 0.38s) This is on Mac, it should be even faster on Linux. Even better, all it takes are ~30 lines of code, and the startup without a dump file works like before.

<2020-01-27 Mon> \\
*Note:* Eli says bug-free dumping of custom emacs is not a goal for Emacs 27[fn:4]. However, dumping only packages, selectively, works fine for me.

* General Design
Start a vanilla Emacs, load packages, dump the image out. Then you start Emacs with this dump file. The point is to speed up packages that you can’t autoload — those you want immediately after startup. For example, company, ivy/helm, which-key, use-package, themes, highlight-parentheses. Other parts of init doesn’t change.

I create a init file for the dump process, =~/.emacs.d/dump.el=, and dump with
#+BEGIN_SRC shell
emacs --batch -q -l ~/.emacs.d/dump.el
#+END_SRC

Once dumped, I can start Emacs with the dump file [fn:2] (use root path, not =~=!):
#+BEGIN_SRC shell
emacs --dump-file="/Users/yuan/.emacs.d/emacs.pdmp"
#+END_SRC

A minimal =dump.el=:
#+BEGIN_SRC emacs-lisp
(require 'package)
;; load autoload files and populate load-path’s
(package-initialize)
;; (package-initialize) doens’t require each package, we need to load
;; those we want manually
(dolist (package '(use-package company ivy counsel org helpful
                    general helpful use-package general which-key
                    recentf-ext swiper ivy-prescient find-char
                    aggressive-indent windman doom-themes winner
                    elec-pair doom-one-light-theme
                    doom-cyberpunk-theme rainbow-delimiters
                    highlight-parentheses hl-todo buffer-move
                    savehist eyebrowse minions ws-butler
                    expand-region isolate outshine flyspell magit
                    eglot))
  (require package))
;; dump image
(dump-emacs-portable "~/.emacs.d/emacs.pdmp")
#+END_SRC

Now let’s extend this minimal configuration with fixes and enhancements.

