note/2020/painless-transition-to-portable-dumper/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-04 Tue 00:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Painless Transition to Portable Dumper</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up-index-page">
<div>
<a accesskey="h" href="../../index.html"> UP </a> |
<a accesskey="H" href="../../index.html"> HOME </a>
</div>
<div>
<a href="../rss.xml"> RSS </a> |
<a href="https://github.com/casouri/casouri.github.io"> Source </a> |
<a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
</div>
</div><div id="content">
<h1 class="title">Painless Transition to Portable Dumper</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3ea95e0">1. General Design</a></li>
<li><a href="#orgfc79eff">2. Gotcha’s</a></li>
<li><a href="#orgdc871f5">3. Tricks</a></li>
<li><a href="#org3a0e5a6">4. Final notes</a></li>
<li><a href="#org586ab01">5. Some fixes and hacks</a></li>
<li><a href="#org8f72c56">6. Other speedup tricks</a></li>
</ul>
</div>
</div>
<p>
Emacs 27 is coming with many exciting new features including the portable dumper. There has been attempts to use portable dumper to speed up Emacs startup time. I know Spacemacs <a href="https://github.com/syl20bnr/spacemacs/blob/develop/core/core-dumper.el">does this</a> from a long time ago <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.  But I couldn’t find any literature on using portable dumper for one’s own init.el. Here I record my take on adopting portable dumper, including gotcha’s I found, the general design I use, and some fixes, hacks and tricks I used.
</p>

<p>
With portable dumper, my startup time reduced from 2.47s to 0.76s (3x). (Everybody measures their startup differently. As a common measure, esup gives 0.38s) This is on Mac, it should be even faster on Linux. Even better, all it takes are ~30 lines of code, and the startup without a dump file works like before.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-27 Mon&gt; </span></span> <br />
<b>Note:</b> Eli says bug-free dumping of custom emacs is not a goal for Emacs 27<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. However, dumping only packages, selectively, works fine for me.
</p>

<div id="outline-container-org3ea95e0" class="outline-2">
<h2 id="org3ea95e0"><span class="section-number-2">1</span> General Design</h2>
<div class="outline-text-2" id="text-1">
<p>
Start a vanilla Emacs, load packages, dump the image out. Then you start Emacs with this dump file. The point is to speed up packages that you can’t autoload — those you want immediately after startup. For example, company, ivy/helm, which-key, use-package, themes, highlight-parentheses. Other parts of init doesn’t change.
</p>

<p>
I create a init file for the dump process, <code>~/.emacs.d/dump.el</code>, and dump with
</p>
<div class="org-src-container">
<pre class="src src-shell">emacs --batch -q -l ~/.emacs.d/dump.el
</pre>
</div>

<p>
Once dumped, I can start Emacs with the dump file <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> (use root path, not <code>~</code>!):
</p>
<div class="org-src-container">
<pre class="src src-shell">emacs --dump-file=<span style="color: #50a14f;">"/Users/yuan/.emacs.d/emacs.pdmp"</span>
</pre>
</div>

<p>
A minimal <code>dump.el</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #e45649;">require</span> '<span style="color: #b751b6;">package</span>)
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">load autoload files and populate load-path&#8217;s</span>
(package-initialize)
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">(package-initialize) doens&#8217;t require each package, we need to load</span>
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">those we want manually</span>
(<span style="color: #e45649;">dolist</span> (package '(use-package company ivy counsel org helpful
                    general helpful use-package general which-key
                    recentf-ext swiper ivy-prescient find-char
                    aggressive-indent windman doom-themes winner
                    elec-pair doom-one-light-theme
                    doom-cyberpunk-theme rainbow-delimiters
                    highlight-parentheses hl-todo buffer-move
                    savehist eyebrowse minions ws-butler
                    expand-region isolate outshine flyspell magit
                    eglot))
  (<span style="color: #e45649;">require</span> <span style="color: #b751b6;">package</span>))
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">dump image</span>
(dump-emacs-portable <span style="color: #50a14f;">"~/.emacs.d/emacs.pdmp"</span>)
</pre>
</div>

<p>
Now let’s extend this minimal configuration with fixes and enhancements.
</p>
</div>
</div>
