note/2020/painless-transition-to-portable-dumper/index.org
* Gotcha’s
So it seems trivial: I ~(package-initialize)~ and ~(require)~ every packages in =dump.el=, and everything works, except that it doesn’t. For one, ~load-path~ is not stored in the dump image [fn:3]. You need to store ~load-path~ in another variable.
#+BEGIN_SRC emacs-lisp
;; in dump.el
(package-initialize)
(setq luna-dumped-load-path load-path)
...
(dump-emacs-portable "~/.emacs.d/emacs.pdmp")

;; in init.el
(setq load-path luna-dumped-load-path)
#+END_SRC

Second, when you start Emacs with a dump file, some default modes are not enabled:
- ~transient-mark-mode~
- ~global-font-lock-mode~
And ~global-undo-tree-mode~ makes Emacs segfault during dumping (didn’t verify, Spacemacs says so, but why would you enable it when dumping anyway?) Spacemacs also says ~winner-mode~ and ~global-undo-tree~ mode doesn’t live through dumping, but I enable them in my =init.el=, not in dump, so that doesn’t affect me.

The fix is simple, have something like this in =init.el=:
#+BEGIN_SRC emacs-lisp
(global-font-lock-mode)
(transient-mark-mode)
#+END_SRC

Third, you can’t use =~= in the =--dump-file= command line flag. Otherwise Emacs complains about cannot open dump file. So don’t use =~/.emacs.d/emacs.pdmp=. The dump file loads in very early stage, many variables are not known yet, so =~= won’t expand.

Fourth, scratch buffer behaves differently when Emacs starts with a dump file.
Re-run mode hook seems to fix it:
#+BEGIN_SRC emacs-lisp
(add-hook 'after-init-hook
                (lambda ()
                  (save-excursion
                    (switch-to-buffer "*scratch*")
                    (lisp-interaction-mode))))
#+END_SRC

<2020-01-27 Mon> \\
As a side note (kindly provided by Damien Cassou), (a relatively new version of) magit uses dynamic modules, which is not dumpable. So don’t require magit in your dump. The portable dumper doesn’t dump window configurations either, but since I’m dumping only the packages, it doesn’t annoy me.

Now the =dump.el= is:
#+BEGIN_SRC emacs-lisp
(require 'package)
;; load autoload files and populate load-path’s
(package-initialize)
;; store load-path
(setq luna-dumped-load-path load-path)
;; (package-initialize) doens’t require each package, we need to load
;; those we want manually
(dolist (package '(use-package company ivy counsel org helpful
                    general helpful use-package general which-key
                    recentf-ext swiper ivy-prescient find-char
                    aggressive-indent windman doom-themes winner
                    elec-pair doom-one-light-theme
                    doom-cyberpunk-theme rainbow-delimiters
                    highlight-parentheses hl-todo buffer-move
                    savehist eyebrowse minions ws-butler
                    expand-region isolate outshine flyspell magit
                    eglot))
  (require package))
;; dump image
(dump-emacs-portable "xxx")
#+END_SRC

=init.el=:
#+BEGIN_SRC emacs-lisp
(global-font-lock-mode)
(transient-mark-mode)
(add-hook 'after-init-hook
                (lambda ()
                  (save-excursion
                    (switch-to-buffer "*scratch*")
                    (lisp-interaction-mode))))
#+END_SRC

* Tricks
** Keep non-dump-file startup working as before
I want my configuration to still work without a dump file. This is what I do:
#+BEGIN_SRC emacs-lisp
;; in init.el
(defvar luna-dumped nil
  "non-nil when a dump file is loaded (because dump.el sets this variable).")

(defmacro luna-if-dump (then &rest else)
  "Evaluate IF if running with a dump file, else evaluate ELSE."
  (declare (indent 1))
  `(if luna-dumped
       ,then
     ,@else))

;; in dump.el
(setq luna-dumped t)
#+END_SRC

And I use the ~luna-if-dump~ in =init.el= at where two startup process differs:
#+BEGIN_SRC emacs-lisp
(luna-if-dump
    (progn
      (setq load-path luna-dumped-load-path)
      (global-font-lock-mode)
      (transient-mark-mode)
      (add-hook 'after-init-hook
                (lambda ()
                  (save-excursion
                    (switch-to-buffer "*scratch*")
                    (lisp-interaction-mode)))))
  ;; add load-path’s and load autoload files
  (package-initialize))
#+END_SRC

In a dump-file-startup, we don’t need to ~(package-initialize)~ because it’s done during dumping, but we need to load ~load-path~ and fix other gotcha’s.

** Dump packages selectively
Blindly dumping every package is a recipe for weird errors. I only dump those I want immediately on startup (company, ivy/helm) and those are big (org). Not that dumping everything doesn’t work, but it takes more energy to get everything right.

