note/2020/painless-transition-to-portable-dumper/index.html

<div id="outline-container-orgfc79eff" class="outline-2">
<h2 id="orgfc79eff"><span class="section-number-2">2</span> Gotcha’s</h2>
<div class="outline-text-2" id="text-2">
<p>
So it seems trivial: I <code>(package-initialize)</code> and <code>(require)</code> every packages in <code>dump.el</code>, and everything works, except that it doesn’t. For one, <code>load-path</code> is not stored in the dump image <sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>. You need to store <code>load-path</code> in another variable.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">in dump.el</span>
(package-initialize)
(<span style="color: #e45649;">setq</span> luna-dumped-load-path load-path)
...
(dump-emacs-portable <span style="color: #50a14f;">"~/.emacs.d/emacs.pdmp"</span>)

<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">in init.el</span>
(<span style="color: #e45649;">setq</span> load-path luna-dumped-load-path)
</pre>
</div>

<p>
Second, when you start Emacs with a dump file, some default modes are not enabled:
</p>
<ul class="org-ul">
<li><code>transient-mark-mode</code></li>
<li><code>global-font-lock-mode</code></li>
</ul>
<p>
And <code>global-undo-tree-mode</code> makes Emacs segfault during dumping (didn’t verify, Spacemacs says so, but why would you enable it when dumping anyway?) Spacemacs also says <code>winner-mode</code> and <code>global-undo-tree</code> mode doesn’t live through dumping, but I enable them in my <code>init.el</code>, not in dump, so that doesn’t affect me.
</p>

<p>
The fix is simple, have something like this in <code>init.el</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-font-lock-mode)
(transient-mark-mode)
</pre>
</div>

<p>
Third, you can’t use <code>~</code> in the <code>--dump-file</code> command line flag. Otherwise Emacs complains about cannot open dump file. So don’t use <code>~/.emacs.d/emacs.pdmp</code>. The dump file loads in very early stage, many variables are not known yet, so <code>~</code> won’t expand.
</p>

<p>
Fourth, scratch buffer behaves differently when Emacs starts with a dump file.
Re-run mode hook seems to fix it:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'after-init-hook
                (<span style="color: #e45649;">lambda</span> ()
                  (<span style="color: #e45649;">save-excursion</span>
                    (switch-to-buffer <span style="color: #50a14f;">"*scratch*"</span>)
                    (lisp-interaction-mode))))
</pre>
</div>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-27 Mon&gt; </span></span> <br />
As a side note (kindly provided by Damien Cassou), (a relatively new version of) magit uses dynamic modules, which is not dumpable. So don’t require magit in your dump. The portable dumper doesn’t dump window configurations either, but since I’m dumping only the packages, it doesn’t annoy me.
</p>

<p>
Now the <code>dump.el</code> is:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #e45649;">require</span> '<span style="color: #b751b6;">package</span>)
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">load autoload files and populate load-path&#8217;s</span>
(package-initialize)
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">store load-path</span>
(<span style="color: #e45649;">setq</span> luna-dumped-load-path load-path)
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">(package-initialize) doens&#8217;t require each package, we need to load</span>
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">those we want manually</span>
(<span style="color: #e45649;">dolist</span> (package '(use-package company ivy counsel org helpful
                    general helpful use-package general which-key
                    recentf-ext swiper ivy-prescient find-char
                    aggressive-indent windman doom-themes winner
                    elec-pair doom-one-light-theme
                    doom-cyberpunk-theme rainbow-delimiters
                    highlight-parentheses hl-todo buffer-move
                    savehist eyebrowse minions ws-butler
                    expand-region isolate outshine flyspell magit
                    eglot))
  (<span style="color: #e45649;">require</span> <span style="color: #b751b6;">package</span>))
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">dump image</span>
(dump-emacs-portable <span style="color: #50a14f;">"xxx"</span>)
</pre>
</div>

<p>
<code>init.el</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-font-lock-mode)
(transient-mark-mode)
(add-hook 'after-init-hook
                (<span style="color: #e45649;">lambda</span> ()
                  (<span style="color: #e45649;">save-excursion</span>
                    (switch-to-buffer <span style="color: #50a14f;">"*scratch*"</span>)
                    (lisp-interaction-mode))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc871f5" class="outline-2">
<h2 id="orgdc871f5"><span class="section-number-2">3</span> Tricks</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd0a6044" class="outline-3">
<h3 id="orgd0a6044"><span class="section-number-3">3.1</span> Keep non-dump-file startup working as before</h3>
<div class="outline-text-3" id="text-3-1">
<p>
I want my configuration to still work without a dump file. This is what I do:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">in init.el</span>
(<span style="color: #e45649;">defvar</span> <span style="color: #6a1868;">luna-dumped</span> nil
  <span style="color: #9ca0a4; font-style: italic;">"non-nil when a dump file is loaded (because dump.el sets this variable)."</span>)

(<span style="color: #e45649;">defmacro</span> <span style="color: #a626a4;">luna-if-dump</span> (then <span style="color: #986801;">&amp;rest</span> else)
  <span style="color: #9ca0a4; font-style: italic;">"Evaluate IF if running with a dump file, else evaluate ELSE."</span>
  (<span style="color: #e45649;">declare</span> (indent 1))
  `(<span style="color: #e45649;">if</span> luna-dumped
       ,then
     ,@else))

<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">in dump.el</span>
(<span style="color: #e45649;">setq</span> luna-dumped t)
</pre>
</div>

<p>
And I use the <code>luna-if-dump</code> in <code>init.el</code> at where two startup process differs:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #e45649;">luna-if-dump</span>
    (<span style="color: #e45649;">progn</span>
      (<span style="color: #e45649;">setq</span> load-path luna-dumped-load-path)
      (global-font-lock-mode)
      (transient-mark-mode)
      (add-hook 'after-init-hook
                (<span style="color: #e45649;">lambda</span> ()
                  (<span style="color: #e45649;">save-excursion</span>
                    (switch-to-buffer <span style="color: #50a14f;">"*scratch*"</span>)
                    (lisp-interaction-mode)))))
  <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">add load-path&#8217;s and load autoload files</span>
  (package-initialize))
</pre>
</div>

<p>
In a dump-file-startup, we don’t need to <code>(package-initialize)</code> because it’s done during dumping, but we need to load <code>load-path</code> and fix other gotcha’s.
</p>
</div>
</div>

<div id="outline-container-org24c3dcc" class="outline-3">
<h3 id="org24c3dcc"><span class="section-number-3">3.2</span> Dump packages selectively</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Blindly dumping every package is a recipe for weird errors. I only dump those I want immediately on startup (company, ivy/helm) and those are big (org). Not that dumping everything doesn’t work, but it takes more energy to get everything right.
</p>
</div>
</div>
