note/2020/painless-transition-to-portable-dumper/index.html

<div id="outline-container-orgc16bdd3" class="outline-3">
<h3 id="orgc16bdd3"><span class="section-number-3">3.3</span> Dumping themes greatly speeds things up</h3>
<div class="outline-text-3" id="text-3-3">
<p>
When profiling my startup with <a href="https://github.com/jschaf/esup">esup</a>, I found Emacs spends 70% of the time loading the theme.
</p>
<pre class="example">
Total User Startup Time: 1.063sec     Total Number of GC Pauses: 21     Total GC Time: 0.646sec

doom-one-light-theme.el:5  0.755sec   71%
(def-doom-theme doom-one-light
"A light theme inspired by Atom One"
...
</pre>

<p>
Dumping themes is not as simple as adding <code>(load-theme theme)</code> to <code>dump.el</code>, if you do that, Emacs complains and doesn’t load the theme. I guess that’s because it’s in batch mode. Instead, require your themes like other libraries and loads them <i>without enabling them</i>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">in dump.el</span>
(<span style="color: #e45649;">require</span> '<span style="color: #b751b6;">doom-themes</span>)
(<span style="color: #e45649;">require</span> '<span style="color: #b751b6;">doom-one-light-theme</span>)
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">the two flags are no-confirm and no-enable</span>
(load-theme 'doom-one-light-theme t t)
</pre>
</div>

<p>
In <code>init.el</code>, we enable the theme, instead of loading it. Unlike require, <code>load-theme</code> doesn’t check if the theme is already loaded.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">in init.el</span>
(<span style="color: #e45649;">when</span> window-system
  (<span style="color: #e45649;">luna-if-dump</span>
      (enable-theme 'doom-one-light)
    (load-theme 'doom-one-light)))
</pre>
</div>

<p>
And the speed up is significant.
</p>
<pre class="example">
...
init.el:87  0.034sec   7%
(when window-system
(luna-if-dump
(enable-theme 'doom-one-light)
(luna-load-theme nil t)))
...
</pre>
</div>
</div>

<div id="outline-container-orga887c55" class="outline-3">
<h3 id="orga887c55"><span class="section-number-3">3.4</span> Complete example <code>dump.el</code> &amp; <code>init.el</code></h3>
<div class="outline-text-3" id="text-3-4">
<p>
With everything I just talked about: <br />
<code>dump.el</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #e45649;">require</span> '<span style="color: #b751b6;">package</span>)
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">load autoload files and populate load-path&#8217;s</span>
(package-initialize)
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">store load-path</span>
(<span style="color: #e45649;">setq</span> luna-dumped-load-path load-path
      luna-dumped t)
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">(package-initialize) doens&#8217;t require each package, we need to load</span>
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">those we want manually</span>
(<span style="color: #e45649;">dolist</span> (package '(use-package company ivy counsel org helpful
                    general helpful use-package general which-key
                    recentf-ext swiper ivy-prescient find-char
                    aggressive-indent windman doom-themes winner
                    elec-pair doom-one-light-theme
                    doom-cyberpunk-theme rainbow-delimiters
                    highlight-parentheses hl-todo buffer-move
                    savehist eyebrowse minions ws-butler
                    expand-region isolate outshine flyspell magit
                    eglot))
  (<span style="color: #e45649;">require</span> <span style="color: #b751b6;">package</span>))
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">pre-load themes</span>
(load-theme 'doom-one-light-theme t t)
(load-theme 'doom-cyberpunk-theme t t)
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">dump image</span>
(dump-emacs-portable <span style="color: #50a14f;">"~/.emacs.d/emacs.pdmp"</span>)
</pre>
</div>

<p>
<code>init.el</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #e45649;">luna-if-dump</span>
    (<span style="color: #e45649;">progn</span>
      (<span style="color: #e45649;">setq</span> load-path luna-dumped-load-path)
      (global-font-lock-mode)
      (transient-mark-mode)
      (add-hook 'after-init-hook
                (<span style="color: #e45649;">lambda</span> ()
                  (<span style="color: #e45649;">save-excursion</span>
                    (switch-to-buffer <span style="color: #50a14f;">"*scratch*"</span>)
                    (lisp-interaction-mode)))))
  <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">add load-path&#8217;s and load autoload files</span>
  (package-initialize))
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">load theme</span>
(<span style="color: #e45649;">when</span> window-system
  (<span style="color: #e45649;">luna-if-dump</span>
      (enable-theme 'doom-one-light)
    (luna-load-theme)))
</pre>
</div>

<p>
After everything works, I wrapped dump file’s path with variables and added <code>defvar</code> for variables I introduced, and did other irrelevant stuff.
</p>
</div>
</div>
</div>

<div id="outline-container-org3a0e5a6" class="outline-2">
<h2 id="org3a0e5a6"><span class="section-number-2">4</span> Final notes</h2>
<div class="outline-text-2" id="text-4">
<p>
You can be more aggressive and dump <i>all</i> packages and init files. But 1) since current approach is fast enough, the marginal benefit you get hardly justifies the effort; 2) if you dump your init files, you need to re-dump every time you change your configuration. Oh, and there are a bunch of Lisp objects that cannot be dumped, e.g., window configuration. Just think about the work needed to handle those in your init files. If you really care that much about speed, <a href="https://github.com/hlissner/doom-emacs">Dark Side</a> is always awaiting.
</p>
</div>
</div>

<div id="outline-container-org586ab01" class="outline-2">
<h2 id="org586ab01"><span class="section-number-2">5</span> Some fixes and hacks</h2>
<div class="outline-text-2" id="text-5">
<p>
Here I record some problems I encountered that’s not related to dumping.
</p>
</div>

<div id="outline-container-orgff3e5f8" class="outline-3">
<h3 id="orgff3e5f8"><span class="section-number-3">5.1</span> recentf-ext</h3>
<div class="outline-text-3" id="text-5-1">
<p>
When dumping recentf-ext, I found some problems and changed two places in <code>recentf-ext.el</code>. It has a <code>(recentf-mode 1)</code> as a top level form. That means <code>recentf-mode</code> enables  whenever <code>recentf-ext.el</code> loads. Not good. I removed it. It also has a line requiring for <code>cl</code>, although it didn’t use it, I removed that as well. My fork is at <a href="https://github.com/casouri/lunarymacs/blob/master/site-lisp/recentf-ext.el">here</a>.
</p>
</div>
</div>

<div id="outline-container-orgbbe61fe" class="outline-3">
<h3 id="orgbbe61fe"><span class="section-number-3">5.2</span> Use esup with dump file</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<a href="https://github.com/jschaf/esup">esup</a> is a great way to see what package is taking most time in startup. It helps me to find what package to dump. However, esup doesn’t support loading dump files, and we need to modify it a bit. We also want to know if we are in esup child process, so we don’t start an emacs server (and do other things differently, depends on your configuration). Go to <code>esup</code> in <code>esup.el</code> (by <code>find-library</code>), and change the <code>process-args</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #50a14f;">"*esup-child*"</span>
 <span style="color: #50a14f;">"*esup-child*"</span>
 ,esup-emacs-path
 ,@args
 <span style="color: #50a14f;">"-q"</span>
 <span style="color: #50a14f;">"-L"</span> ,esup-load-path
 <span style="color: #50a14f;">"-l"</span> <span style="color: #50a14f;">"esup-child"</span>
 <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">+++++++++++++++++++++++++++++++++++++++++</span>
 <span style="color: #50a14f;">"--dump-file=/Users/yuan/.emacs.d/emacs.pdmp"</span>
 <span style="color: #50a14f;">"--eval (setq luna-in-esup t)"</span>
 <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">+++++++++++++++++++++++++++++++++++++++++</span>
 ,(format <span style="color: #50a14f;">"--eval=(esup-child-run \"%s\" \"%s\" %d)"</span>
          init-file
          esup-server-port
          esup-depth))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8f72c56" class="outline-2">
<h2 id="org8f72c56"><span class="section-number-2">6</span> Other speedup tricks</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org6fd8df6" class="outline-3">
<h3 id="org6fd8df6"><span class="section-number-3">6.1</span> early-init.el</h3>
<div class="outline-text-3" id="text-6-1">
<p>
This <a href="https://www.reddit.com/r/emacs/comments/enmbv4/earlyinitel_reduce_init_time_about_02_sec_and/">post about early-init.el speedup</a> is useful. Here is <a href="https://github.com/casouri/lunarymacs/blob/master/early-init.el">my early-init.el</a>.
</p>
</div>
</div>
