note/2020/painless-transition-to-portable-dumper/index.org
** Start with correct frame size
Normally Emacs starts with a small frame, and if you have ~(toggle-frame-maximized)~, it later expands to the full size. You can eliminate this annoying flicker and make Emacs show up with full frame size. I learned it from [[https://emacs-china.org/t/emacs/11271/11?u=casouri][this emacs-china post]]. Basically you use =-g= (for geometry) and =--font= flags together to size the startup frame. I use
#+BEGIN_SRC shell
~/bin/emacs -g 151x50 -font "SF Mono-13"
#+END_SRC

At the point (<2020-01-18 Sat>) you can’t use =--dump-file= with =-g= and =-font= because of a bug, but it should be fixed soon. See [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=39168][here]].

** Eliminate theme flicker
Manateelazycat [[https://github.com/manateelazycat/lazycat-emacs/blob/39a74af15d3343219997a3c7894e9bb87cfc4e6c/site-lisp/config/init.el#L17][sets default background to theme background in custom.el]]. This way Emacs starts with your theme’s background color, instead of white.

[fn:1] And people have been using the old dumping facility for a even longer time, you can found more on EmacsWiki.

[fn:2] Apart from =--dump-file=, =--dump= also works, even though =emacs --help= didn’t mention it. Spacemacs uses =--dump=.

[fn:3] You can found more about it in Emacs 27’s Manual. I was foolish enough to read the online manual (Emacs 26 at the time) and not aware of the ~load-path~ thing until I read Spacemacs’s implementation.

[fn:4] Quote from [[https://www.reddit.com/r/emacs/comments/eqhvt7/use_portable_dumper_in_your_init/fewiwr7?utm_source=share&utm_medium=web2x][reddit]]:
#+BEGIN_QUOTE
Caveat emptor: Re-dumping is still not 100% bug-free in the current Emacs codebase (both the emacs-27 release branch and master). There are known issues, and quite probably some unknown ones. Making re-dumping bug-free is not a goal for Emacs 27.1, so this feature should be at this point considered as experimental "use at your own risk" one.
#+END_QUOTE
