note/2020/painless-transition-to-portable-dumper/index.html

<div id="outline-container-orgfe69e64" class="outline-3">
<h3 id="orgfe69e64"><span class="section-number-3">6.2</span> Start with correct frame size</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Normally Emacs starts with a small frame, and if you have <code>(toggle-frame-maximized)</code>, it later expands to the full size. You can eliminate this annoying flicker and make Emacs show up with full frame size. I learned it from <a href="https://emacs-china.org/t/emacs/11271/11?u=casouri">this emacs-china post</a>. Basically you use <code>-g</code> (for geometry) and <code>--font</code> flags together to size the startup frame. I use
</p>
<div class="org-src-container">
<pre class="src src-shell">~/bin/emacs -g 151x50 -font <span style="color: #50a14f;">"SF Mono-13"</span>
</pre>
</div>

<p>
At the point (<span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-18 Sat&gt;</span></span>) you can’t use <code>--dump-file</code> with <code>-g</code> and <code>-font</code> because of a bug, but it should be fixed soon. See <a href="https://debbugs.gnu.org/cgi/bugreport.cgi?bug=39168">here</a>.
</p>
</div>
</div>

<div id="outline-container-orga2025a8" class="outline-3">
<h3 id="orga2025a8"><span class="section-number-3">6.3</span> Eliminate theme flicker</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Manateelazycat <a href="https://github.com/manateelazycat/lazycat-emacs/blob/39a74af15d3343219997a3c7894e9bb87cfc4e6c/site-lisp/config/init.el#L17">sets default background to theme background in custom.el</a>. This way Emacs starts with your theme’s background color, instead of white.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
And people have been using the old dumping facility for a even longer time, you can found more on EmacsWiki.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
Quote from <a href="https://www.reddit.com/r/emacs/comments/eqhvt7/use_portable_dumper_in_your_init/fewiwr7?utm_source=share&amp;utm_medium=web2x">reddit</a>:
</p>
<blockquote>
<p>
Caveat emptor: Re-dumping is still not 100% bug-free in the current Emacs codebase (both the emacs-27 release branch and master). There are known issues, and quite probably some unknown ones. Making re-dumping bug-free is not a goal for Emacs 27.1, so this feature should be at this point considered as experimental "use at your own risk" one.
</p>
</blockquote></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
Apart from <code>--dump-file</code>, <code>--dump</code> also works, even though <code>emacs --help</code> didn’t mention it. Spacemacs uses <code>--dump</code>.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
You can found more about it in Emacs 27’s Manual. I was foolish enough to read the online manual (Emacs 26 at the time) and not aware of the <code>load-path</code> thing until I read Spacemacs’s implementation.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Written by Yuan Fu <<a href="mailto:casouri@gmail.com">casouri@gmail.com</a>></p>
<p class="first-publish">First Published on 2020-01-17 Fri 23:34</p>
<p class-"last-modified">Last modified on 2020-02-03 Mon 23:02</p>
</div>
</body>
</html>
